In [1]:
import pandas as pd

In [2]:
data = {
'Name': ['Alice','Bob', 'Charlie', 'David', 'Eva'],
'Age': [25, 30, 35, 40, 45],
'City': [ 'New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Seattle']
}

In [6]:
df = pd.DataFrame(data, index=["A", "B", "C", "D", "E"])
df

      Name  Age           City
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles
D    David   40        Chicago
E      Eva   45        Seattle

In [11]:
df.loc["C": "E"]

      Name  Age         City
C  Charlie   35  Los Angeles
D    David   40      Chicago
E      Eva   45      Seattle

In [15]:
df.iloc[1, 0]

'Bob'

In [17]:
df.loc["A", "Age"]

np.int64(25)

In [30]:
df = pd.read_excel("sample_pivot.xlsx")
df

          Date Region                 Type  Units  Sales
0   2020-07-11   East  Children's Clothing   18.0    306
1   2020-09-23  North  Children's Clothing   14.0    448
2   2020-04-02  South     Women's Clothing   17.0    425
3   2020-02-28   East  Children's Clothing   26.0    832
4   2020-03-19   West     Women's Clothing    3.0     33
..         ...    ...                  ...    ...    ...
995 2020-02-11   East  Children's Clothing   35.0    735
996 2020-12-25  North       Men's Clothing    NaN   1155
997 2020-08-31  South       Men's Clothing   13.0    208
998 2020-08-23  South     Women's Clothing   17.0    493
999 2020-08-17  North     Women's Clothing   25.0    300

[1000 rows x 5 columns]

In [34]:
pivot1 = pd.pivot_table(df, index="Region", values="Sales", aggfunc=["median", "mean", "sum"])
pivot1

       median        mean     sum
        Sales       Sales   Sales
Region
East    363.0  408.182482  167763
North   385.0  438.924051  138700
South   408.0  432.956204   59315
West    417.0  452.029412   61476

In [37]:
pivot4 = pd.pivot_table(df, index="Region", columns="Type", values="Sales")
pivot4

Type    Children's Clothing  Men's Clothing  Women's Clothing
Region
East             405.743363      423.647541        399.028409
North            438.894118      449.157303        432.528169
South            412.666667      475.435897        418.924528
West             480.523810      465.292683        419.188679